
let text = prompt ('Введите сумму');


const Num1 = [
    '1': 'одна',
    '2': 'дві',
    '3': 'три',
    '4': 'чотири',
    '5': 'пять',
    '6': 'шість',
    '7': 'сім',
    '8': 'вісім',
    '9': 'девять',
    '10': 'десять',
    '11': 'одинадцять',
    '12': 'дванадцять',
    '13': 'тринадцять',
    '14': 'чотирнадцять',
    '15': 'пятнадцять',
    '16': 'шістнадцять',
    '17': 'сімнадцять',
    '18': 'вісімнадцять',
    '19': 'девятнадцять',
    ' ': ' ',
   ]

   const Num2 = [
    '20': 'одна',
    '30': 'дві',
    '40': 'три',
    '50': 'чотири',
    '60': 'пять',
    '70': 'шість',
    '80': 'сім',
    '90': 'вісім',
    ' ': ' ',
   ]

console.log (alphabet[text[0]],alphabet[text[1]],number1[text[2]],number1[text[3]],number1[text[4]],number1[text[5]]);